<div dir=3D"ltr"><div class=3D"markdown-here-wrapper" id=3D"markdown-here-wrapper-292694" style><h1 id=3D"purpose" style=3D"margin:1.3em 0px 1em;padding:0px;font-weight:bold;font-size:1.6em">Purpose</h1>
<p style=3D"margin:1.2em 0px!important">The main purpose of this article is to show programmers that they have the ability to use full-featured C++ within Microsoft Windows kernel modules, and to help programmers understand how C++ can be used in this way. To this end, we will compare different types of compilers and embedded compilers in terms of exception handling. This article focuses on the 32-bit Microsoft CL compiler (an article focusing on the 64-bit version is currently being developed).  </p>

<p style=3D"margin:1.2em 0px!important"><em>This article refers to the free open-source libraries xStl and XDK <strong>(TODO! Links)</strong>, which implement C++ and allow programs to write C++ kernel mode drivers.</em></p>

<h1 id=3D"overview" style=3D"margin:1.3em 0px 1em;padding:0px;font-weight:bold;font-size:1.6em">Overview</h1>

    <span class=3D"keyword" style=3D"color:rgb(249,38,114);font-weight:bold">return</span> <span class=3D"number">0</span>;
}
</code></pre>
<p style=3D"margin:1.2em 0px!important">The output of the execution is:</p>
<pre style=3D"font-size:0.85em;font-family:Consolas,Inconsolata,Courier,monospace;font-size:1em;line-height:1.2em;margin:1.2em 0px"><code style=3D"font-size:0.85em;font-family:Consolas,Inconsolata,Courier,monospace;margin:0px 0.15em;padding:0px 0.3em;white-space:pre-wrap;border:1px solid rgb(234,234,234);background-color:rgb(248,248,248);border-top-left-radius:3px;border-top-right-radius:3px;border-bottom-right-radius:3px;border-bottom-left-radius:3px;display:inline;white-space:pre;overflow:auto;border-top-left-radius:3px;border-top-right-radius:3px;border-bottom-right-radius:3px;border-bottom-left-radius:3px;border:1px solid rgb(204,204,204);padding:0.5em 0.7em;display:block!important;display:block;padding:0.5em;background-color:rgb(39,40,34);background-repeat:initial initial;color:rgb(221,221,221)">Divide by zero...
Filter has been called, code: C0000094, EIP: 53803
Exception was executed C0000094
</code></pre><p style=3D"margin:1.2em 0px!important">The exception code was generated in the kernel. Exception code: C0000094 is <a href="http://nologs.com/ntstatus.html">STATUS_INTEGER_DIVIDE_BY_ZERO</a>. The EIP (instruction pointer) is the virtual memory location of the assembler instruction &ldquo;DIV&rdquo;.</p>

<p style=3D"margin:1.2em 0px!important">SEH has two types of exceptions: software exceptions raised by &ldquo;<a href="http://msdn.microsoft.com/en-us/library/windows/desktop/ms680552(v=3Dvs.85).aspx">RaiseException</a>&ldquo; and exceptions triggered by fault in the kernel (such as a memory violation, divided by zero, errors with floats, etc.).</p>

<h2 id=3D"seh-how-is-it-implemented-fs-0-" style=3D"margin:1.3em 0px 1em;padding:0px;font-weight:bold;font-size:1.4em;border-bottom-width:1px;border-bottom-style:solid;border-bottom-color:rgb(204,204,204)">SEH: How Is It Implemented? (fs:[0])</h2>

<p style=3D"margin:1.2em 0px!important">SEH uses KPCR structure. The KPCR structure can be shown by <a href="http://msdn.microsoft.com/en-us/windows/hardware/gg463009">WinDbg</a> and by adding a symbol server:</p>
<pre style=3D"font-size:0.85em;font-family:Consolas,Inconsolata,Courier,monospace;font-size:1em;line-height:1.2em;margin:1.2em 0px"><code style=3D"font-size:0.85em;font-family:Consolas,Inconsolata,Courier,monospace;margin:0px 0.15em;padding:0px 0.3em;white-space:pre-wrap;border:1px solid rgb(234,234,234);background-color:rgb(248,248,248);border-top-left-radius:3px;border-top-right-radius:3px;border-bottom-right-radius:3px;border-bottom-left-radius:3px;display:inline;white-space:pre;overflow:auto;border-top-left-radius:3px;border-top-right-radius:3px;border-bottom-right-radius:3px;border-bottom-left-radius:3px;border:1px solid rgb(204,204,204);padding:0.5em 0.7em;display:block!important;display:block;padding:0.5em;background-color:rgb(39,40,34);background-repeat:initial initial;color:rgb(221,221,221)">0:000&gt; dt _KPCR
ntdll!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x000 GdtBase          : Ptr64 _KGDTENTRY64
   +0x008 TssBase          : Ptr64 _KTSS64
   +0x010 UserRsp          : Uint8B
   +0x018 Self             : Ptr64 _KPCR
   +0x020 CurrentPrcb      : Ptr64 _KPRCB
   +0x028 LockArray        : Ptr64 _KSPIN_LOCK_QUEUE
   +0x030 Used_Self        : Ptr64 Void
   +0x038 IdtBase          : Ptr64 _KIDTENTRY64
   +0x040 Unused           : [2] Uint8B
   +0x050 Irql             : UChar
   +0x051 SecondLevelCacheAssociativity : UChar
   +0x052 ObsoleteNumber   : UChar
   +0x053 Fill0            : UChar
   +0x054 Unused0          : [3] Uint4B
   +0x060 MajorVersion     : Uint2B
   +0x062 MinorVersion     : Uint2B
   +0x064 StallScaleFactor : Uint4B
   +0x068 Unused1          : [3] Ptr64 Void
   +0x080 KernelReserved   : [15] Uint4B
   +0x0bc SecondLevelCacheSize : Uint4B
   +0x0c0 HalReserved      : [16] Uint4B
   +0x100 Unused2          : Uint4B
   +0x108 KdVersionBlock   : Ptr64 Void
   +0x110 Unused3          : Ptr64 Void
   +0x118 PcrAlign1        : [24] Uint4B
   +0x180 Prcb             : _KPRCB
0:000&gt; dt _NT_TIB
ntdll!_NT_TIB
   +0x000 ExceptionList    : Ptr64 _EXCEPTION_REGISTRATION_RECORD
   +0x008 StackBase        : Ptr64 Void
   +0x010 StackLimit       : Ptr64 Void
   +0x018 SubSystemTib     : Ptr64 Void
   +0x020 FiberData        : Ptr64 Void
   +0x020 Version          : Uint4B
   +0x028 ArbitraryUserPointer : Ptr64 Void
   +0x030 Self             : Ptr64 _NT_TIB
</code></pre><p style=3D"margin:1.2em 0px!important">The KPCR in Win32 platforms is mapped at 0xFFDFF120 (kernel) and is mapped to segment FS, to allow access for user-mode threads. All Windows threads have a unique KPCR. During the context-switch, Windows also switches this memory region.</p>

<p style=3D"margin:1.2em 0px!important">SEH rides on the first pointer of NT_TIB: the exception list. Each function that uses SEH has a prologue that looks like this:</p>
